# FillGrid Constructor (FillGrid) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillGrid Constructor (FillGrid)
FillGrid Class See Also
---
Constructs a new FillGrid with default settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public FillGrid(
	FillGrid other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As FillGrid _
)
```

Visual C++
---
```text
public:
FillGrid(
	FillGrid^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..FillGrid
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FillGrid Class
FillGrid Overload
Autodesk.Revit.DB Namespace